0.original/kappat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kappat;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "../setUp"


dimensions      [0 2 -1 0 0 0 0];

internalField   uniform $kappat0;

boundaryField
{
    lower
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    upper
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    west 
    {
        type            cyclic;
    }
    east 
    {
        type            cyclic;
    }
    north 
    {
        type            cyclic;
    }
    south
    {
        type            cyclic;
    }
}


// ************************************************************************* //
