system/sampling/probeData1
    probe1
    {
          type                probes;
          functionObjectLibs ("libsampling.so");
          name                probe1;
          outputControl       timeStep;
          outputInterval      1;
          fields
          (
              U
              T
              p
              p_rgh
              kSgs
              nuSgs
              RdevSgs
              qSgs
          );
          
          probeLocations
          (
                   (2500.001 500.001 5.001)
                   (2500.001 500.001 15.001)
                   (2500.001 500.001 25.001)
                   (2500.001 500.001 35.001)
                   (2500.001 500.001 45.001)
                   (2500.001 500.001 55.001)
                   (2500.001 500.001 65.001)
                   (2500.001 500.001 75.001)
                   (2500.001 500.001 85.001)
                   (2500.001 500.001 95.001)
                   (2500.001 500.001 105.001)
                   (2500.001 500.001 115.001)
                   (2500.001 500.001 125.001)
                   (2500.001 500.001 135.001)
                   (2500.001 500.001 145.001)
                   (2500.001 500.001 155.001)
                   (2500.001 500.001 165.001)
                   (2500.001 500.001 175.001)
                   (2500.001 500.001 185.001)
                   (2500.001 500.001 195.001)
                   (2500.001 500.001 205.001)
                   (2500.001 500.001 215.001)
                   (2500.001 500.001 225.001)
                   (2500.001 500.001 235.001)
                   (2500.001 500.001 245.001)
                   (2500.001 500.001 255.001)
                   (2500.001 500.001 265.001)
                   (2500.001 500.001 275.001)
                   (2500.001 500.001 285.001)
                   (2500.001 500.001 295.001)
                   (2500.001 500.001 305.001)
                   (2500.001 500.001 315.001)
                   (2500.001 500.001 325.001)
                   (2500.001 500.001 335.001)
                   (2500.001 500.001 345.001)
                   (2500.001 500.001 355.001)
                   (2500.001 500.001 365.001)
                   (2500.001 500.001 375.001)
                   (2500.001 500.001 385.001)
                   (2500.001 500.001 395.001)
                   (2500.001 500.001 405.001)
                   (2500.001 500.001 415.001)
                   (2500.001 500.001 425.001)
                   (2500.001 500.001 435.001)
                   (2500.001 500.001 445.001)
                   (2500.001 500.001 455.001)
                   (2500.001 500.001 465.001)
                   (2500.001 500.001 475.001)
                   (2500.001 500.001 485.001)
                   (2500.001 500.001 495.001)
                   (2500.001 500.001 505.001)
                   (2500.001 500.001 515.001)
                   (2500.001 500.001 525.001)
                   (2500.001 500.001 535.001)
                   (2500.001 500.001 545.001)
                   (2500.001 500.001 555.001)
                   (2500.001 500.001 565.001)
                   (2500.001 500.001 575.001)
                   (2500.001 500.001 585.001)
                   (2500.001 500.001 595.001)
                   (2500.001 500.001 605.001)
                   (2500.001 500.001 615.001)
                   (2500.001 500.001 625.001)
                   (2500.001 500.001 635.001)
                   (2500.001 500.001 645.001)
                   (2500.001 500.001 655.001)
                   (2500.001 500.001 665.001)
                   (2500.001 500.001 675.001)
                   (2500.001 500.001 685.001)
                   (2500.001 500.001 695.001)
                   (2500.001 500.001 705.001)
                   (2500.001 500.001 715.001)
                   (2500.001 500.001 725.001)
                   (2500.001 500.001 735.001)
                   (2500.001 500.001 745.001)
                   (2500.001 500.001 755.001)
                   (2500.001 500.001 765.001)
                   (2500.001 500.001 775.001)
                   (2500.001 500.001 785.001)
                   (2500.001 500.001 795.001)
                   (2500.001 500.001 805.001)
                   (2500.001 500.001 815.001)
                   (2500.001 500.001 825.001)
                   (2500.001 500.001 835.001)
                   (2500.001 500.001 845.001)
                   (2500.001 500.001 855.001)
                   (2500.001 500.001 865.001)
                   (2500.001 500.001 875.001)
                   (2500.001 500.001 885.001)
                   (2500.001 500.001 895.001)
                   (2500.001 500.001 905.001)
                   (2500.001 500.001 915.001)
                   (2500.001 500.001 925.001)
                   (2500.001 500.001 935.001)
                   (2500.001 500.001 945.001)
                   (2500.001 500.001 955.001)
                   (2500.001 500.001 965.001)
                   (2500.001 500.001 975.001)
                   (2500.001 500.001 985.001)
                   (2500.001 500.001 995.001)
                   (2500.001 500.001 1005.001)
                   (2500.001 500.001 1015.001)
                   (2500.001 500.001 1025.001)
                   (2500.001 500.001 1035.001)
                   (2500.001 500.001 1045.001)
                   (2500.001 500.001 1055.001)
                   (2500.001 500.001 1065.001)
                   (2500.001 500.001 1075.001)
                   (2500.001 500.001 1085.001)
                   (2500.001 500.001 1095.001)
                   (2500.001 500.001 1105.001)
                   (2500.001 500.001 1115.001)
                   (2500.001 500.001 1125.001)
                   (2500.001 500.001 1135.001)
                   (2500.001 500.001 1145.001)
                   (2500.001 500.001 1155.001)
                   (2500.001 500.001 1165.001)
                   (2500.001 500.001 1175.001)
                   (2500.001 500.001 1185.001)
                   (2500.001 500.001 1195.001)
                   (2500.001 500.001 1205.001)
                   (2500.001 500.001 1215.001)
                   (2500.001 500.001 1225.001)
                   (2500.001 500.001 1235.001)
                   (2500.001 500.001 1245.001)
                   (2500.001 500.001 1255.001)
                   (2500.001 500.001 1265.001)
                   (2500.001 500.001 1275.001)
                   (2500.001 500.001 1285.001)
                   (2500.001 500.001 1295.001)
                   (2500.001 500.001 1305.001)
                   (2500.001 500.001 1315.001)
                   (2500.001 500.001 1325.001)
                   (2500.001 500.001 1335.001)
                   (2500.001 500.001 1345.001)
                   (2500.001 500.001 1355.001)
                   (2500.001 500.001 1365.001)
                   (2500.001 500.001 1375.001)
                   (2500.001 500.001 1385.001)
                   (2500.001 500.001 1395.001)
                   (2500.001 500.001 1405.001)
                   (2500.001 500.001 1415.001)
                   (2500.001 500.001 1425.001)
                   (2500.001 500.001 1435.001)
                   (2500.001 500.001 1445.001)
                   (2500.001 500.001 1455.001)
                   (2500.001 500.001 1465.001)
                   (2500.001 500.001 1475.001)
                   (2500.001 500.001 1485.001)
                   (2500.001 500.001 1495.001)
                   (2500.001 500.001 1505.001)
                   (2500.001 500.001 1515.001)
                   (2500.001 500.001 1525.001)
                   (2500.001 500.001 1535.001)
                   (2500.001 500.001 1545.001)
                   (2500.001 500.001 1555.001)
                   (2500.001 500.001 1565.001)
                   (2500.001 500.001 1575.001)
                   (2500.001 500.001 1585.001)
                   (2500.001 500.001 1595.001)
                   (2500.001 500.001 1605.001)
                   (2500.001 500.001 1615.001)
                   (2500.001 500.001 1625.001)
                   (2500.001 500.001 1635.001)
                   (2500.001 500.001 1645.001)
                   (2500.001 500.001 1655.001)
                   (2500.001 500.001 1665.001)
                   (2500.001 500.001 1675.001)
                   (2500.001 500.001 1685.001)
                   (2500.001 500.001 1695.001)
                   (2500.001 500.001 1705.001)
                   (2500.001 500.001 1715.001)
                   (2500.001 500.001 1725.001)
                   (2500.001 500.001 1735.001)
                   (2500.001 500.001 1745.001)
                   (2500.001 500.001 1755.001)
                   (2500.001 500.001 1765.001)
                   (2500.001 500.001 1775.001)
                   (2500.001 500.001 1785.001)
                   (2500.001 500.001 1795.001)
                   (2500.001 500.001 1805.001)
                   (2500.001 500.001 1815.001)
                   (2500.001 500.001 1825.001)
                   (2500.001 500.001 1835.001)
                   (2500.001 500.001 1845.001)
                   (2500.001 500.001 1855.001)
                   (2500.001 500.001 1865.001)
                   (2500.001 500.001 1875.001)
                   (2500.001 500.001 1885.001)
                   (2500.001 500.001 1895.001)
                   (2500.001 500.001 1905.001)
                   (2500.001 500.001 1915.001)
                   (2500.001 500.001 1925.001)
                   (2500.001 500.001 1935.001)
                   (2500.001 500.001 1945.001)
                   (2500.001 500.001 1955.001)
                   (2500.001 500.001 1965.001)
                   (2500.001 500.001 1975.001)
                   (2500.001 500.001 1985.001)
                   (2500.001 500.001 1995.001)
          );
    }
